{
  "What is AI?": "AI stands for Artificial Intelligence, the simulation of human intelligence in machines.",
  "What is Machine Learning?": "Machine Learning is a subset of AI that enables computers to learn from data.",
  "What is a CPU?": "CPU stands for Central Processing Unit, and it's responsible for executing instructions in a computer.",
  "What is a GPU?": "A GPU is a Graphics Processing Unit, mainly used for rendering images and training AI models.",
  "What is the difference between HTTP and HTTPS?": "HTTPS is the secure version of HTTP, using encryption to protect data.",
  "What is cloud computing?": "Cloud computing is the delivery of computing services over the internet.",
  "What is an API?": "An API (Application Programming Interface) allows different software systems to communicate.",
  "What is Git?": "Git is a distributed version control system used to track changes in source code.",
  "What is open-source software?": "Open-source software is software with source code that anyone can inspect, modify, and enhance.",
  "What is cybersecurity?": "Cybersecurity is the practice of protecting systems and networks from digital attacks.",
  "What is HTML?": "HTML stands for HyperText Markup Language and is used to structure content on the web.",
  "What is JavaScript?": "JavaScript is a programming language used to make web pages interactive.",
  "What is Python?": "Python is a high-level, interpreted programming language known for its readability.",
  "What is blockchain?": "Blockchain is a distributed ledger technology that securely records transactions across many computers.",
  "What is encryption?": "Encryption is the process of converting data into a secure format to prevent unauthorized access.",
  "What is the Internet of Things (IoT)?": "IoT refers to the network of physical devices connected to the internet, collecting and sharing data.",
  "What is a firewall?": "A firewall is a network security device that monitors and filters incoming and outgoing traffic.",
  "What is a domain name?": "A domain name is the address people type in a browser to visit your website, like example.com.",
  "What is DNS?": "DNS stands for Domain Name System; it translates domain names into IP addresses.",
  "What is an IP address?": "An IP address is a unique number assigned to each device connected to the internet.",
  "What is software development?": "Software development is the process of designing, coding, testing, and maintaining applications.",
  "What is agile methodology?": "Agile is a software development method based on iterative development and customer feedback.",
  "What is Scrum?": "Scrum is a framework for agile project management, focusing on teamwork and accountability.",
  "What is DevOps?": "DevOps is a set of practices that combines software development and IT operations.",
  "What is a virtual machine?": "A virtual machine is a software emulation of a computer that runs an operating system.",
  "What is a container in tech?": "Containers are lightweight, standalone packages that include everything needed to run a piece of software.",
  "What is Docker?": "Docker is a platform used to develop, ship, and run applications inside containers.",
  "What is Kubernetes?": "Kubernetes is an open-source system for automating the deployment and scaling of containerized apps.",
  "What is a compiler?": "A compiler translates source code written in a programming language into machine code.",
  "What is a text editor?": "A text editor is a program used to write and edit code, such as VS Code or Sublime Text.",
  "What is the difference between frontend and backend?": "Frontend refers to the UI of a website, while backend involves server-side logic and databases.",
  "What is a framework?": "A framework is a set of tools and libraries that helps developers build applications more efficiently.",
  "What is artificial general intelligence (AGI)?": "AGI refers to machines with human-level intelligence across a wide range of tasks.",
  "What is a neural network?": "A neural network is a series of algorithms that mimic the human brain to recognize patterns and data.",
  "What is version control?": "Version control systems help track changes to code and coordinate work among developers.",
  "What is SSH?": "SSH (Secure Shell) is a protocol used to securely connect to remote servers.",
  "What is SaaS?": "SaaS stands for Software as a Service — software hosted in the cloud and accessed via the internet.",
  "What is latency in networking?": "Latency is the delay between sending and receiving data over a network.",
  "What is bandwidth?": "Bandwidth is the maximum rate of data transfer across a network path.",
  "What is a bug in programming?": "A bug is an error or flaw in a software program that causes incorrect results.",
  "What is debugging?": "Debugging is the process of finding and fixing bugs in code.",
  "What is a database index?": "An index is a data structure that improves the speed of data retrieval operations on a database.",
  "What is SQL?": "SQL (Structured Query Language) is used to communicate with and manipulate databases.",
  "What is NoSQL?": "NoSQL databases store data in formats other than relational tables, like documents or key-value pairs.",
  "What is JSON?": "JSON (JavaScript Object Notation) is a lightweight format for storing and exchanging data.",
  "What is REST API?": "REST is an architectural style for building web services that use HTTP methods to access resources.",
  "What is OAuth?": "OAuth is an open standard for access delegation, commonly used for token-based authentication.",
  "What is a software license?": "A software license defines how software can be used and distributed.",
  "What is responsive design?": "Responsive design ensures a website looks good on all screen sizes and devices.",
  "What is a CDN?": "A CDN (Content Delivery Network) is a system of distributed servers that deliver web content based on user location.",
  "What is a browser cookie?": "A cookie is a small file stored on a user’s device by a website to remember information.",
  "What is two-factor authentication?": "Two-factor authentication adds a second layer of security by requiring a second form of verification.",
  "What is biometrics in technology?": "Biometrics refers to using physical characteristics like fingerprints for identification and security.",
  "What is a cache?": "A cache stores data temporarily to speed up future access.",
  "What is virtualization?": "Virtualization is the process of creating a virtual version of something, like a server or OS.",
  "What is a logic gate?": "A logic gate is a basic building block of digital circuits that performs a logical operation.",
  "What is binary code?": "Binary code is the language computers use, consisting of 0s and 1s.",
  "What is an operating system kernel?": "The kernel is the core of an operating system, managing system resources and communication.",
  "What is multitasking in operating systems?": "Multitasking allows multiple processes to run concurrently on a computer."
  
}
